* Version 1: print only
  
#+name: dweight1
#+begin_src C :results output :tangle ../src/dweight1.c
  #include <stdio.h>

  int main(void) {
    int height=8, length=12, width=10, volume, weight;

//    volume = height * length * width;
//   weight = (volume + 165) / 166;

    printf("Dimensions: %dx%dx%d\n", length, width, height);
    printf("Volume (cubic inches): %d\n", volume = height * length * width);
    printf("Dimensional weight (pounds): %d\n", (volume + 165) / 166);

  return 0;
 }
#+end_src

#+RESULTS: dweight1
: Dimensions: 12x10x8
: Volume (cubic inches): 960
: Dimensional weight (pounds): 6

* Version 2: reading input
  
#+name: dweight2
#+begin_src C :results output
  #include <stdio.h>

  int main(void) {
    int height=8, length=12, width=10, volume, weight;

//    volume = height * length * width;
//   weight = (volume + 165) / 166;

    printf("Dimensions: %dx%dx%d\n", length, width, height);
    printf("Volume (cubic inches): %d\n", volume = height * length * width);
    printf("Dimensional weight (pounds): %d\n", (volume + 165) / 166);

  return 0;
 }
#+end_src

#+RESULTS: dweight
: Dimensions: 12x10x8
: Volume (cubic inches): 960
: Dimensional weight (pounds): 6


